ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/TARGET_NUMAKER_PFM_NUC472/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
    {PA_11, UART_0, SYS_GPA_MFPH_PA11MFP_UART0_RTS},
    {PA_15, UART_2, SYS_GPA_MFPH_PA15MFP_UART2_RTS},
    {PB_4, UART_1, SYS_GPB_MFPL_PB4MFP_UART1_RTS},
    {PB_6, UART_4, SYS_GPB_MFPL_PB6MFP_UART4_RTS},
    {PB_9, UART_5, SYS_GPB_MFPH_PB9MFP_UART5_RTS},
    {PB_12, UART_4, SYS_GPB_MFPH_PB12MFP_UART4_RTS},
    {PC_2, UART_4, SYS_GPC_MFPL_PC2MFP_UART4_RTS},
    {PD_6, UART_3, SYS_GPD_MFPL_PD6MFP_UART3_RTS},
    {PD_14, UART_5, SYS_GPD_MFPH_PD14MFP_UART5_RTS},
    {PF_8, UART_2, SYS_GPF_MFPH_PF8MFP_UART2_RTS},
    {PF_11, UART_1, SYS_GPF_MFPH_PF11MFP_UART1_RTS},
    {PF_15, UART_0, SYS_GPF_MFPH_PF15MFP_UART0_RTS},
    {PG_8, UART_4, SYS_GPG_MFPH_PG8MFP_UART4_RTS},
    {PH_13, UART_3, SYS_GPH_MFPH_PH13MFP_UART3_RTS},
    
    {NC,    NC,     0}
};

const PinMap PinMap_UART_CTS[] = {
    {PA_12, UART_0, SYS_GPA_MFPH_PA12MFP_UART0_CTS},
    {PB_5, UART_1, SYS_GPB_MFPL_PB5MFP_UART1_CTS},
    {PB_7, UART_4, SYS_GPB_MFPL_PB7MFP_UART4_CTS},
    {PB_8, UART_5, SYS_GPB_MFPH_PB8MFP_UART5_CTS},
    {PB_13, UART_4, SYS_GPB_MFPH_PB13MFP_UART4_CTS},
    {PC_3, UART_4, SYS_GPC_MFPL_PC3MFP_UART4_CTS},
    {PC_9, UART_2, SYS_GPC_MFPH_PC9MFP_UART2_CTS},
    {PD_7, UART_3, SYS_GPD_MFPL_PD7MFP_UART3_CTS},
    {PD_13, UART_5, SYS_GPD_MFPH_PD13MFP_UART5_CTS},
    {PF_12, UART_1, SYS_GPF_MFPH_PF12MFP_UART1_CTS},
    {PG_0, UART_0, SYS_GPG_MFPL_PG0MFP_UART0_CTS},
    {PG_9, UART_4, SYS_GPG_MFPH_PG9MFP_UART4_CTS},
    {PH_2, UART_2, SYS_GPH_MFPL_PH2MFP_UART2_CTS},
    {PH_14, UART_3, SYS_GPH_MFPH_PH14MFP_UART3_CTS},
    
    {NC,    NC,     0}
};

//*** SPI ***

const PinMap PinMap_SPI_MOSI[] = {
    {PA_10, SPI_3, SYS_GPA_MFPH_PA10MFP_SPI3_MOSI0},
    {PA_12, SPI_3, SYS_GPA_MFPH_PA12MFP_SPI3_MOSI1},
    {PB_5, SPI_2, SYS_GPB_MFPL_PB5MFP_SPI2_MOSI0},
    {PB_13, SPI_2, SYS_GPB_MFPH_PB13MFP_SPI2_MOSI1},
    {PC_4, SPI_0, SYS_GPC_MFPL_PC4MFP_SPI0_MOSI0},
    {PC_7, SPI_0, SYS_GPC_MFPL_PC7MFP_SPI0_MOSI0},
    {PC_13, SPI_1, SYS_GPC_MFPH_PC13MFP_SPI1_MOSI1},
    {PC_15, SPI_1, SYS_GPC_MFPH_PC15MFP_SPI1_MOSI0},
    {PD_9, SPI_3, SYS_GPD_MFPH_PD9MFP_SPI3_MOSI1},
    {PE_3, SPI_0, SYS_GPE_MFPL_PE3MFP_SPI0_MOSI0},
    {PE_7, SPI_0, SYS_GPE_MFPL_PE7MFP_SPI0_MOSI0},
    {PE_11, SPI_0, SYS_GPE_MFPH_PE11MFP_SPI0_MOSI1},
    {PF_0, SPI_1, SYS_GPF_MFPL_PF0MFP_SPI1_MOSI0},
    {PF_1, SPI_2, SYS_GPF_MFPL_PF1MFP_SPI2_MOSI0},
    {PF_5, SPI_3, SYS_GPF_MFPL_PF5MFP_SPI3_MOSI0},
    {PG_8, SPI_2, SYS_GPG_MFPH_PG8MFP_SPI2_MOSI0},
    {PH_8, SPI_2, SYS_GPH_MFPH_PH8MFP_SPI2_MOSI0},
    {PH_10, SPI_2, SYS_GPH_MFPH_PH10MFP_SPI2_MOSI1},
    {PI_6, SPI_3, SYS_GPI_MFPL_PI6MFP_SPI3_MOSI0},
    {PI_8, SPI_3, SYS_GPI_MFPH_PI8MFP_SPI3_MOSI1},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PA_2, SPI_3, SYS_GPA_MFPL_PA2MFP_SPI3_MISO0},
    {PA_9, SPI_3, SYS_GPA_MFPH_PA9MFP_SPI3_MISO0},
    {PA_11, SPI_3, SYS_GPA_MFPH_PA11MFP_SPI3_MISO1},
    {PB_4, SPI_2, SYS_GPB_MFPL_PB4MFP_SPI2_MISO0},
    {PB_12, SPI_2, SYS_GPB_MFPH_PB12MFP_SPI2_MISO1},
    {PC_3, SPI_0, SYS_GPC_MFPL_PC3MFP_SPI0_MISO1},
    {PC_6, SPI_0, SYS_GPC_MFPL_PC6MFP_SPI0_MISO0},
    {PC_14, SPI_1, SYS_GPC_MFPH_PC14MFP_SPI1_MISO1},
    {PD_0, SPI_1, SYS_GPD_MFPL_PD0MFP_SPI1_MISO0},
    {PD_8, SPI_3, SYS_GPD_MFPH_PD8MFP_SPI3_MISO1},
    {PD_15, SPI_1, SYS_GPD_MFPH_PD15MFP_SPI1_MISO0},
    {PE_2, SPI_0, SYS_GPE_MFPL_PE2MFP_SPI0_MISO0},
    {PE_6, SPI_0, SYS_GPE_MFPL_PE6MFP_SPI0_MISO0},
    {PE_10, SPI_0, SYS_GPE_MFPH_PE10MFP_SPI0_MISO1},
    {PF_4, SPI_3, SYS_GPF_MFPL_PF4MFP_SPI3_MISO0},
    {PG_7, SPI_2, SYS_GPG_MFPL_PG7MFP_SPI2_MISO0},
    {PH_7, SPI_2, SYS_GPH_MFPL_PH7MFP_SPI2_MISO0},
    {PH_9, SPI_2, SYS_GPH_MFPH_PH9MFP_SPI2_MISO1},
    {PI_5, SPI_3, SYS_GPI_MFPL_PI5MFP_SPI3_MISO0},
    {PI_7, SPI_3, SYS_GPI_MFPL_PI7MFP_SPI3_MISO1},
    {PI_12, SPI_2, SYS_GPI_MFPH_PI12MFP_SPI2_MISO1},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
    {PA_4, SPI_3, SYS_GPA_MFPL_PA4MFP_SPI3_CLK},
    {PA_8, SPI_3, SYS_GPA_MFPH_PA8MFP_SPI3_CLK},
    {PB_3, SPI_2, SYS_GPB_MFPL_PB3MFP_SPI2_CLK},
    {PC_8, SPI_0, SYS_GPC_MFPH_PC8MFP_SPI0_CLK},
    {PD_1, SPI_1, SYS_GPD_MFPL_PD1MFP_SPI1_CLK},
    {PD_14, SPI_1, SYS_GPD_MFPH_PD14MFP_SPI1_CLK},
    {PE_5, SPI_0, SYS_GPE_MFPL_PE5MFP_SPI0_CLK},
    {PF_3, SPI_3, SYS_GPF_MFPL_PF3MFP_SPI3_CLK},
    {PG_9, SPI_2, SYS_GPG_MFPH_PG9MFP_SPI2_CLK},
    {PH_6, SPI_2, SYS_GPH_MFPL_PH6MFP_SPI2_CLK},
    {PI_4, SPI_3, SYS_GPI_MFPL_PI4MFP_SPI3_CLK},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PA_5, SPI_3, SYS_GPA_MFPL_PA5MFP_SPI3_SS0},
    {PA_7, SPI_3, SYS_GPA_MFPL_PA7MFP_SPI3_SS0},
    {PB_2, SPI_2, SYS_GPB_MFPL_PB2MFP_SPI2_SS0},
    {PC_2, SPI_0, SYS_GPC_MFPL_PC2MFP_SPI0_SS0},
    {PC_12, SPI_1, SYS_GPC_MFPH_PC12MFP_SPI1_SS0},
    {PD_13, SPI_1, SYS_GPD_MFPH_PD13MFP_SPI1_SS0},
    {PE_4, SPI_0, SYS_GPE_MFPL_PE4MFP_SPI0_SS0},
    {PF_2, SPI_3, SYS_GPF_MFPL_PF2MFP_SPI3_SS0},
    {PH_5, SPI_2, SYS_GPH_MFPL_PH5MFP_SPI2_SS0},
    {PI_3, SPI_3, SYS_GPI_MFPL_PI3MFP_SPI3_SS0},
    {PI_11, SPI_2, SYS_GPI_MFPH_PI11MFP_SPI2_SS0},
    
    {NC,    NC,    0}
};
